[
  {
    "topic": "some, any, no",
    "id": 7,
    "sentences": [
      {
        "polish": "Masz przyjaciół?",
        "english": "Do you have any friends?"
      },
      {
        "polish": "Daj mu trochę mleka.",
        "english": "Give me some milk."
      },
      {
        "polish": "Nie dawaj mu mleka.",
        "english": "Don’t give him any milk."
      },
      {
        "polish": "Znam kilku znanych ludzi.",
        "english": "I know some famous people."
      },
      {
        "polish": "Nie znam znanych ludzi.",
        "english": "I don’t know any famous people."
      },
      {
        "polish": "John je jakieś mięso.",
        "english": "John is eating some meat."
      },
      {
        "polish": "John nie je żadnego mięsa.",
        "english": "John isn’t eating any meat."
      },
      {
        "polish": "On ma jakieś pieniądze.",
        "english": "He has got some money."
      },
      {
        "polish": "Czy on ma jakieś pieniądze?",
        "english": "Has he got any money."
      },
      {
        "polish": "On nie ma pieniędzy.",
        "english": "He has got no money."
      },
      {
        "polish": "Nie znamy żadnych sąsiadów.",
        "english": "We don’t know any neighbors."
      },
      {
        "polish": "Nie lubię żadnych blogerów.",
        "english": "I don’t like any bloggers."
      },
      {
        "polish": "Nie czyta żadnych książek.",
        "english": "He doesn’t read any books."
      },
      {
        "polish": "On nie robi żadnych zdjęć.",
        "english": "He is not taking any pictures."
      },
      {
        "polish": "Nie oglądają żadnych filmów.",
        "english": "They are not watching any films."
      },
      {
        "polish": "Nie śpij z żadnymi kobietami.",
        "english": "He is not sleeping with women."
      },
      {
        "polish": "Nie mam pojęcia.",
        "english": "I have no idea."
      },
      {
        "polish": "Nie mogę dać ci pieniędzy. Przestań do mnie dzwonić, mamo!",
        "english": "I can’t give you any money. Stop calling me, mom!"
      },
      {
        "polish": "Jacyś Paparazzi czekają na zewnątrz. Jesteś kimś znanym?",
        "english": "Some paparazzi are waiting outside. Are you famous?"
      },
      {
        "polish": "Sarah jest samotna, ponieważ nie ma żadnych przyjaciół.",
        "english": "Sarah is lonely, because she doesn’t have any friends."
      },
      {
        "polish": "Sarah jest samotna, ponieważ nie ma przyjaciół.",
        "english": "Sarah is lonely, because she has no friends."
      },
      {
        "polish": "Zara nie jest samotna, ponieważ ma przyjaciół.",
        "english": "Sarah isn’t lonely, because she has some friends."
      },
      {
        "polish": "Jakakolwiek pizza to dobra pizza. Bez znaczenia jakiego jest rodzaju, zawsze jest świetna.",
        "english": "Any pizza is good pizza. It doesn’t matter what kind it is, it’s always great."
      },
      {
        "polish": "Luke jest na terapii, ponieważ ma jakieś problemy z alkoholem.",
        "english": "Luke is in therapy because he has some problems with alcohol."
      },
      {
        "polish": "Ostatnio miewam dziwne sny.",
        "english": "I’ve been having some strange dreams lately."
      },
      {
        "polish": "‚Jak nazywa się twoja żona?‚ ‚Nie mam pojęcia. Od 30 lat nazywam ją kochanie.’",
        "english": "‘What is your wife’s name?’ ‚I have no idea. I’ve been calling her ‘sweetheart’ for the last 30 years.’"
      },
      {
        "polish": "Wyglądasz na zmęczonego. Czy piłeś dzisiaj kawę?",
        "english": "You look tired. Have you had any coffee today?"
      },
      {
        "polish": "Wyglądasz na zmęczonego. Co powiesz na to bym zrobiła ci jakąś kawę?",
        "english": "You look tired. How about if I make you some coffee?"
      },
      {
        "polish": "‚Wina?’ ‚Nie, dziękuję. Nie pijam żadnego alkoholu.’",
        "english": "‘Wine?’ ‘No, thanks. I don’t drink any alcohol.’"
      },
      {
        "polish": "‚Wina?’ ‚ nie, dziękuję. Nie pijam alkoholu.’",
        "english": "‘Wine?’ ‘No, thanks. I drink no alcohol.’"
      },
      {
        "polish": "Samochód nie zniknął tak po prostu. Musi być jakieś wyjaśnienia.",
        "english": "The car didn’t just disappear. There must be some explanation."
      },
      {
        "polish": "Żaden mężczyzna nie był kiedykolwiek na Jowiszu.",
        "english": "No man has ever been to Jupiter."
      },
      {
        "polish": "Chcesz trochę pizzy?",
        "english": "Would you like some pizza?"
      },
      {
        "polish": "Muszę wypić trochę krwi.",
        "english": "I must drink some blood."
      },
      {
        "polish": "Nie mam czasu.",
        "english": "I have no time."
      },
      {
        "polish": "Masz czas?",
        "english": "Do you have any time?"
      },
      {
        "polish": "Nie kupuj narkotyków.",
        "english": "Do not buy any drugs."
      },
      {
        "polish": "Czy twój pies umie robić jakieś sztuczki?",
        "english": "Can your dog do any tricks?"
      },
      {
        "polish": "Potrzebuje świeżego powietrza.",
        "english": "I need some fresh air."
      },
      {
        "polish": "Niektóre rzeczy w życiu się nie zmieniają.",
        "english": "Sam things in life don’t change."
      },
      {
        "polish": "Jakieś dziecko płacze na górze.",
        "english": "Some baby is crying upstairs."
      },
      {
        "polish": "Niektórzy myślą, że jestem kobietą.",
        "english": "Some people think that I am a woman."
      }
    ]
  },
  {
    "topic": "much, many, a lot of",
    "id": 9,
    "sentences": [
      {
        "polish": "Ludzie myślą, że youtuberzy zarabiają dużo pieniędzy. To nie jest prawda.",
        "english": "People think all YouTubers make a lot of money. That is not true."
      },
      {
        "polish": "Zbyt dużo się martwisz. Przestań myśleć o tym co może pójść nie tak!",
        "english": "You worry a lot. Stop thinking about what cold go wrong!"
      },
      {
        "polish": "W Nowym Yorku mieszka dużo ludzi.",
        "english": "A lot of people live in New York City."
      },
      {
        "polish": "Phil wydaje dużo pieniędzy na ubrania. Być może powinien zostać projektantem mody.",
        "english": "Phil spends a lot of money on clothes. Perhaps he should be a fashion designer."
      },
      {
        "polish": "Lloyd lubie cię, Mary. Bardzo cię lubi.",
        "english": "Lloyd likes you, Mary. He likes you a lot."
      },
      {
        "polish": "‚Nauczenie się nowego języka zabiera dużo czasu.’ ‚Masz na mysli dłużej niż miesiąc?’",
        "english": "‘It takes a lot of time to learn a foreign language.’ ‘You mean more than a month?’"
      },
      {
        "polish": "Kotki dużo śpią. Czasami nawet 20 godzin dziennie.",
        "english": "Kittens sleep a lot. Sometimes even 20 hours a day"
      },
      {
        "polish": "'Sommelier' to nie osoba z Somalii, a ktoś kto zna się bardzo dobrze na winach.",
        "english": "A sommelier is not someone from Somalia, it’s someone who knows a lot about wine."
      },
      {
        "polish": "Każdego dnia otrzymuje dużo zaproszeń do grupy znajomych na Facebooku.",
        "english": "I get a lot of friend requests on Facebook every day."
      },
      {
        "polish": "‚Ile masz dzieci?’ ‚Nie wiem dokładnie, ale jest ich dużo. Coś koło 4 czy 5.’",
        "english": "‘How many children do you have?’ ‘I don’t know exactly, but it’s a lot. It could be 4 or 5.’"
      },
      {
        "polish": "Nie było wielu gości w restauracji, ale jedzenie było wyśmienite. W szczególności posmakowały mi ośmiornice.",
        "english": "There weren’t many guests in the restaurant, but the food was delicious. I especially liked the octopus."
      },
      {
        "polish": "Nie martw się tak bardzo. Jestem pewien, że wyniki egzaminu będą w porządku.",
        "english": "Don’t worry so much. I’m sure the exam results will be fine."
      },
      {
        "polish": "‚Jeden.’ ‚Ilu psychopatów potrzeba do wymiany żarówki?’",
        "english": "‘One.’ ‘How many psychics do you need to change a lightbulb?’"
      },
      {
        "polish": "Nie mam za wiele pieniędzy, ale stać mnie na bilet do kina.",
        "english": "I don’t have much money, but I can afford a cinema ticket."
      },
      {
        "polish": "Lekcja anatomii. ‚Czy jest to męska czy damska miednica?’ ‚To musi być meska. Penis znajdował się tutaj.’ ‚O, tak. Wiele razy.’",
        "english": "An anatomy lesson. ‘Is this a male or a female pelvis?’ ‘It must be male. A penis was here.’ ‘Oh yes. Many times.’"
      },
      {
        "polish": "Nie otrzymuje wielu zaproszeń do grupy znajomych na Facebooku.",
        "english": "I don’t get many friend requests on Facebook."
      },
      {
        "polish": "‚Co za piękna dziewczynka!’ ‚Dziękuje bardzo, ale to jest chlopczyk.’",
        "english": "‘What a beautiful baby girl!’ ‘Thank you very much, but it’s a boy.’"
      },
      {
        "polish": "Dlaczego jest tu tyle paparazzi na froncie budynku?",
        "english": "Why are there so many paparazzi in front of our house?"
      },
      {
        "polish": "Zbyt wiele kucharzy psuje rosół.",
        "english": "Too many cooks spoil the broth."
      },
      {
        "polish": "Nie zamówię dzisiejszego wieczora żadnej pizzy, ponieważ ma zbyt dużo kalorii. Zjem zamiast tego sałatkę.",
        "english": "I won’t have any pizza tonight, because it has too many calories. I have some salad instead."
      },
      {
        "polish": "Poznałem wiele interesujących ludzi w Azji. To były świetne wakacje.",
        "english": "I’ve met so many interesting people in Asia. It was a great holiday."
      },
      {
        "polish": "Nie spędzaj dużo czasu na myśleniu o tym. Po prostu to zrób.",
        "english": "Don’t spend much time thinking about it. Just do it."
      },
      {
        "polish": "Jak możesz pracować w takim bałaganie? Jest tu tak wiele rzeczy, że nie wiem co gdzie jest!",
        "english": "How can you work in such a mess? There are so many things here I don’t know where anything is!"
      },
      {
        "polish": "Nie mam pojecia ile drinków wczoraj wypiłam.",
        "english": "I have no idea how many drinks I had last night."
      },
      {
        "polish": "Ile krzeseł potrzebujemy na imprezę?",
        "english": "How many chairs do we need for the party?"
      },
      {
        "polish": "Ile dzieci pracuje w fabryce?",
        "english": "How many children work in the factory?"
      },
      {
        "polish": "Ile czasu potrzebujesz na swoją prezentacje?",
        "english": "How much time do you need for your presentation?"
      },
      {
        "polish": "Ilu masz dobrych znajomych?",
        "english": "How many good friends do you have?"
      },
      {
        "polish": "Ile cukru dodajesz do herbaty?",
        "english": "How much sugar do you put in your tea?"
      },
      {
        "polish": "Ile czasu spędzasz dziennie na instagramie?",
        "english": "How much time do you spend on Instagram every day?"
      },
      {
        "polish": "Ile książek przeczytałeś w tym roku?",
        "english": "How many books have you read this year?"
      },
      {
        "polish": "Ile prezentów dostałeś w zeszłym roku na święta?",
        "english": "How many presents did you get last Christmas?"
      },
      {
        "polish": "Ile hiszpańskich słów znasz?",
        "english": "How many words can you say in Spanish?"
      },
      {
        "polish": "Ile mleka potrzebujesz do swojego ciasta?",
        "english": "How much milk do you need for your cake?"
      },
      {
        "polish": "Ile jajek potrzebujesz do swojego ciasta?",
        "english": "How many eggs do you need for your cake?"
      },
      {
        "polish": "Ile maki potrzebujesz do swojego ciasta?",
        "english": "How much flour do you need for your cake?"
      },
      {
        "polish": "Nie wiem ile mam pieniędzy.",
        "english": "I don’t know how much money I have."
      },
      {
        "polish": "Czy powiedział ci ile miał żon?",
        "english": "Did he tell you how many wives he had had?"
      },
      {
        "polish": "Ile lat spędziłeś w więzieniu?",
        "english": "How many years did you spend in prison? "
      }
    ]
  },
  {
    "topic": "I was writting - Past Continuous",
    "id": 19,
    "sentences": [
      {
        "polish": "Spałem.",
        "english": "I was sleeping."
      },
      {
        "polish": "Oglądałeś film dla dorosłych",
        "english": "You were watching an adult film."
      },
      {
        "polish": "Eric robił wegańską kanapkę.",
        "english": "Eric was making a vegan sandwich."
      },
      {
        "polish": "Słuchaliśmy podkastu.",
        "english": "We were listening to a podcast."
      },
      {
        "polish": "Dzieci ściągały nowa aplikacje.",
        "english": "The children were downloading a new app."
      },
      {
        "polish": "Panna młoda szykowała się.",
        "english": "The bride was getting ready."
      },
      {
        "polish": "Jego siostra rozmawiała przez telefon.",
        "english": "His sister was talking on the phone."
      },
      {
        "polish": "Latałem nad miastem.",
        "english": "I was flying over the city."
      },
      {
        "polish": "Krzyczałeś na mnie.",
        "english": "You were shouting at me."
      },
      {
        "polish": "Mój doktor wypisywał mi receptę.",
        "english": "My doctor was writing a prescription."
      },
      {
        "polish": "Wszyscy płakali.",
        "english": "Everyone was crying."
      },
      {
        "polish": "Mieszkaliśmy razem w 2011.",
        "english": "We weren’t living together in 2011."
      },
      {
        "polish": "Przepraszam, tylko próbowałem ci pomóc. Nie obawiaj się.",
        "english": "I’m sorry, I was only trying to help you. Don’t be afraid."
      },
      {
        "polish": "Z kim oni rozmawiali po koncercie?",
        "english": "Who was they talking to after the concert?"
      },
      {
        "polish": "Nasza szefowa nie pracował do późna zesłej nocy. Była na kolacji ze swoim mężem w tej restauracji.",
        "english": "Our boss wasn’t working late last night. She was having dinner with her husband in this restaurant."
      },
      {
        "polish": "Erin, skoro nie wierzysz już w tego typu rzeczy, to dlaczego szukasz tej książki?",
        "english": "Erin, if you don’t believe in this stuff anymore, then why were you looking for the book?"
      },
      {
        "polish": "Proszę pani, muszę zadać pani kilka pytań. Co robiła pani o 23:20 21 października?",
        "english": "Ma’am, I have to ask you a few questions. What were you doing at 11.20 p.m. on October 21st?"
      },
      {
        "polish": "Zeszłego poranka jedliśmy śniadanie kiedy usłyszeliśmy głośny hałas.",
        "english": "Yesterday morning we were having breakfast when we heard a loud noise."
      },
      {
        "polish": "Tak, dobrze, właśnie tu. Właśnie opowiadałam Bobowi o naszych wakacjach w Włoszech.",
        "english": "Oh, good, you’re here. I was just telling Bob about our holiday in Italy."
      }
    ]
  },
  {
    "topic": "I wrote czy I was writing? - Past Simple czy Past Continuous?",
    "id": 20,
    "sentences": [
      {
        "polish": "Co wczoraj robiłeś?",
        "english": "What were you doing yesterday?"
      },
      {
        "polish": "Co wczoraj zrobiłeś?",
        "english": "What did you do yesterday?"
      },
      {
        "polish": "Dziecko robiło siku.",
        "english": "The child was peeing."
      },
      {
        "polish": "Dziecko zrobiło siku.",
        "english": "The child peed."
      },
      {
        "polish": "Pies szczekał.",
        "english": "The dog was barking."
      },
      {
        "polish": "Pies zaszczekał.",
        "english": "The dog barked."
      },
      {
        "polish": "Tłumaczyła zasady.",
        "english": "She was explaining the rules."
      },
      {
        "polish": "Wytłumaczyła zasady.",
        "english": "She explained it the rules."
      },
      {
        "polish": "Uczył mnie angielskiego.",
        "english": "He was teaching me English."
      },
      {
        "polish": "Nauczył mnie angielskiego.",
        "english": "He taught me English."
      },
      {
        "polish": "Zeszlej nocy jechaliśmy do domu, gdy zobaczyliśmy ducha na środku drogi!",
        "english": "We were driving home last night, when we saw a ghost in the middle of the road!"
      },
      {
        "polish": "Internet wyłączył się na 5 minut, więc wyszedłem ze swojego pokoju i zacząłem rozmawiać ze swoją rodzina. Wydają się być bardzo miłymi ludźmi.",
        "english": "The internet broke down for 5 minutes, so I left my room and started talking to my family. They seem to be very nice people."
      },
      {
        "polish": "Zeszłej nocy grałam w grę na mojej komórce, gdy ten nagle spadł na nos.",
        "english": "Last night I was playing a game on my phone in bed when it suddenly fell on my nose."
      },
      {
        "polish": "Gdy żegnałam się z moimi starymi znajomymi z pracy oni powiedzieli mi bym się nie zmieniała. Dobra, w takim razie cały ten cellulit nigdzie się nie wymiera.",
        "english": "As I was saying goodbye to my old colleagues, they told me not to change. All right, all this cellulite is not going anywhere then."
      },
      {
        "polish": "Dziecko spało, gdy sąsiedzi zaczęli wiercić w ścianie.",
        "english": "The baby was sleeping when the neighbors started drilling into their wall."
      },
      {
        "polish": "Biegłem by zdążyć na autobus, ale drzwi zamknęły się tuż przed moja twarzą i autobus odjechał. Ale widzisz, nie wszystko w moim życiu jest udane. I wtedy znalazłem $100 na ulicy. Żartuje, to było $200.",
        "english": "I was running to catch my bus but it closed the door right in front of me and left. You see, not everything is a success in my life. And then I found $100 in the street. Just kidding. It was $200."
      },
      {
        "polish": "Wszyscy tańczyli, gdy muzyka nagle zatrzymała się.",
        "english": "Everyone was dancing when the music suddenly stopped."
      },
      {
        "polish": "Aktor złamał sobie nos, gdy odgrywał scenę pościgu samochodowego.",
        "english": "The actor broke his nose when he was shooting a car chase scene."
      },
      {
        "polish": "Wczoraj o 8 oglądałam Grę O Tron. Zaczęłam o 7:30 a skończyłam o 8:30.",
        "english": "At 8 o’clock yesterday I was watching ‘Game of Thrones’. I started at 7.30 and I finished at 8.30."
      },
      {
        "polish": "Podczas gdy bawiliśmy się z naszym kotem usłyszeliśmy dziwny dźwięk.",
        "english": "While we were playing with our cat, we heard a strange noise."
      },
      {
        "polish": "Dlaczego płakałeś gdy powiedziałam ci o biletach na koncert One Direction?",
        "english": "Why were you crying when I told you about the tickets to the One Direction concert?"
      },
      {
        "polish": "Kiedy Paul wrócił do domu, to dzieci nie spały. Budowały domek dla ptaków w ogrodzie.",
        "english": "When Paul came back home, the children weren’t sleeping. They were building a birdhouse in the garden."
      },
      {
        "polish": "Jechałam uberem, gdy uderzył nas bautobus!",
        "english": "I was riding in Uber when a bus hit us!"
      },
      {
        "polish": "Wszyscy widzieliśmy światło, ale nikt nie wiedział co to było.",
        "english": "We all saw the light, but no one knew what it was."
      },
      {
        "polish": "Znalazłam mojego kota w łazience. Leżał w koszu na ubrania.",
        "english": "I found my cat in the bathroom. She was laying in the laundry basket."
      },
      {
        "polish": "Oglądaliśmy hokeja i nagle Chris złapał krążek! To było wspaniałe!",
        "english": "We were watching a game of hockey and suddenly Chris caught the puck! It was amazing!"
      },
      {
        "polish": "Spójrz, ten kotek zasnął podczas jedzenia. Czy ona nie jest słodka?",
        "english": "Look, the kitten fell asleep while she was eating. Isn’t she the cutest?"
      },
      {
        "polish": "Strażak próbował uratować dziecko kiedy przyjechały kolejne dwie straże pożarne.",
        "english": "The firefighter was trying to rescue the baby when two more firetrucks arrived."
      },
      {
        "polish": "Nasza drużyna wygrywała jedną minutę przed końcem gry, gdy drużyna przeciwnika zdobyła dwa punkty, więc końcowo przegraliśmy.",
        "english": "Our team was winning one minute before the end of the game when the guest team scored two points and in the end we lost."
      },
      {
        "polish": "Podczas gdy wy staliście w kącie, tamta dziewczyna dała mi swój numer. Miłej nocy, frajerzy!",
        "english": "While you guys were standing in the corner, that girl gave me her phone number. Have a good night, suckers!"
      }
    ]
  },
  {
    "topic": "I have broken - Present Perfect",
    "id": 21,
    "sentences": [
      {
        "polish": "Zjadłeś wszystkie banany.",
        "english": "You have eaten all the bananas."
      },
      {
        "polish": "Złamała rękę.",
        "english": ""
      },
      {
        "polish": "Billy posprzątał swój pokój",
        "english": ""
      },
      {
        "polish": "Porozmawiałam z trzema osobami.",
        "english": ""
      },
      {
        "polish": "Billy przeczytał dziesięć stron.",
        "english": ""
      },
      {
        "polish": "Widzieli ten fiml dwa razy.",
        "english": ""
      },
      {
        "polish": "Nie zrobiliśmy wszystkiego.",
        "english": ""
      },
      {
        "polish": "Miałeś kiedyś kaca?",
        "english": ""
      },
      {
        "polish": "Nigdy nie pływaliśmy nago.",
        "english": ""
      },
      {
        "polish": "Już tu kiedyś byłam.",
        "english": ""
      },
      {
        "polish": "Elvis Presley nigdy nie mieszkał w Australii.",
        "english": ""
      },
      {
        "polish": "Szekspir nigdy nie był na koncercie Justina Biebera.",
        "english": ""
      },
      {
        "polish": "Właśnie umyłam włosy.",
        "english": ""
      },
      {
        "polish": "Stella jeszcze nie skończyła.",
        "english": ""
      },
      {
        "polish": "Stella już skończyła.",
        "english": ""
      },
      {
        "polish": "Czy Stella już skończyła?",
        "english": ""
      },
      {
        "polish": "Ostatnio byłem bardzo zajęty.",
        "english": ""
      },
      {
        "polish": "Co ostatnio przeczytałaś?",
        "english": ""
      },
      {
        "polish": "Mieszkam tu od 2 lat.",
        "english": ""
      },
      {
        "polish": "Mieszkałem tu przez 2 lata.",
        "english": ""
      },
      {
        "polish": "Znam Jill od 2015 roku.",
        "english": ""
      },
      {
        "polish": "Znam Jill od 2 lat.",
        "english": ""
      },
      {
        "polish": "W tym tygodniu zjadłem 6 pizz.",
        "english": ""
      },
      {
        "polish": "Odwiozła mnie dziś do szkoły.",
        "english": ""
      },
      {
        "polish": "Po raz pierwszy jem ślimaki.",
        "english": ""
      },
      {
        "polish": "Spotykamy się drugi raz.",
        "english": ""
      },
      {
        "polish": "Piję czwartego drinka.",
        "english": ""
      },
      {
        "polish": "Czy on je szóstego lizaka?",
        "english": ""
      },
      {
        "polish": "Byłeś w Londynie?",
        "english": ""
      },
      {
        "polish": "Byłem w Londynie.",
        "english": ""
      },
      {
        "polish": "Byłem w Londynie 5 razy.",
        "english": ""
      },
      {
        "polish": "Jestem w Londynie od roku.",
        "english": ""
      },
      {
        "polish": "Jak długo jesteś w Londynie?",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      },
      {
        "polish": "",
        "english": ""
      }

    ]
  },
  {
    "topic": "I broke czy I have broken - Past Simple czy Present Perfect?",
    "id": 22,
    "sentences": [
      {
        "polish": "Otworzyłeś mój list?",
        "english": "Have you opened my letter?"
      },
      {
        "polish": "Ciotka Greta odwiedziła nas trzy lata temu.",
        "english": "Aunt Greta visited us three years ago."
      },
      {
        "polish": "Nigdy nie byłam w Sydney.",
        "english": "I have never been to Sydney."
      },
      {
        "polish": "Moi rodzice złapali tę rybę w zeszłym roku.",
        "english": "My parents caught this fish last year."
      },
      {
        "polish": "Czy Sally wypróbowała spadochroniastwo?",
        "english": "Has Sally tried skydiving?"
      },
      {
        "polish": "Chris poszedł do kina w zeszłym tygodniu.",
        "english": "Chris went to the cinema last week."
      },
      {
        "polish": "Dawid Podsiadło napisał wiele pięknych piosenek.",
        "english": "Dawid Podsiadlo has written many beautiful songs."
      },
      {
        "polish": "Nie wspięli się wczoraj na tę górę.",
        "english": "They didn’t climb this mountain yesterday."
      },
      {
        "polish": "Nie powiedzieliśmy o tym nikomu.",
        "english": "We haven’t told anyone about this."
      },
      {
        "polish": "Co robiłeś po szkole w zeszły poniedziałek?",
        "english": "What did you do after school last Monday?"
      },
      {
        "polish": "Chyba zgubiłem moje klucze. Wiesz gdzie są?",
        "english": "I think I have lost my keys. Do you know where they are?"
      },
      {
        "polish": "Ktoś ukradł mój rower. Pomocy!",
        "english": "Somebody has stolen my bike. Help!"
      },
      {
        "polish": "Kiedy poznałem Kevina myślałem, że był dziewczyną.",
        "english": "When I met Kevin, I thought he was a girl."
      },
      {
        "polish": "Andy wygrał na loterii 500 dolarów. Cieszę się z jego szczęście!",
        "english": "Andy has won $500 at the lottery. I’m so happy for him!"
      },
      {
        "polish": "Ile kieliszków wina wypiłaś?",
        "english": "How many glasses of wine have you drunk?"
      },
      {
        "polish": "Ile kieliszków wina wypiłaś zeszłej nocy?",
        "english": "How many glasses of wine did you drink last night?"
      },
      {
        "polish": "Kiedy jest przerwa w dostawie prądu szukamy odpowiedzi na trzy pytania: 1) Czy naładowałem telefon? 2) Gdzie są świeczki? 3) Co powinienem teraz zrobić?",
        "english": "When there’s a blackout, we look for three answers: 1) However I charged my phone? 2) Where are the candles? 3) What should I do now?"
      },
      {
        "polish": "Tak jak mówiłam wcześniej, nigdy się nie powtarzam.",
        "english": "Like I have said before, I never repeat myself."
      },
      {
        "polish": "Przepraszam, czy ty jesteś Vanessa? Cześć, jestem Kevin. Jestem znajomym Kelly, dużo mi o tobie opowiadała.",
        "english": "Excuse me, are you Vanessa? Hi, I’m Kevin. I’m a friend of Kelly‘s, she has told me a lot about you."
      },
      {
        "polish": "Patrick zawsze jedzie do szkoły busem 101, ale wczoraj tak się spieszył, że złapał taksówkę.",
        "english": "Patrick always takes that 101 bus to school, but yesterday he was in such a hurry that he caught a taxi."
      },
      {
        "polish": "‘Przepraszam, chciałbym zwrócić ten kostium kobiety kot.’ ‘Oczywiście, proszę pana. Kiedy pan to kupił?’",
        "english": "‘Excuse me, i’d like to return this catwoman costume.’ ‘Certainly, madam. When did you purchase it?’"
      },
      {
        "polish": "Nigdy wcześniej nie widziałem nagiej dziewczyny. Wygląda dziwnie bez ubrań.",
        "english": "I have never seen a naked girl before. She looks strange without clothes."
      },
      {
        "polish": "‘Dzadku, jak to jest możliwe, że unawiasz się z inną kobietą każdej nocy?’ ‘Nie wiem’, powiedział ziadek i oblizał swoje brwi.",
        "english": "‘Grandpa, how is it possible that you date a different woman every night?’ ‘I don’t know’, grandpa said and licked his eyebrows.’"
      },
      {
        "polish": "Kiedy wchodzę do pokoju i nagle koty rozchodzą się, czuję się jakbym przeszkodziła w ważnym spotkaniu.",
        "english": "When I enter a room and the cats suddenly walk out, I feel like I have just interrupted an important meeting."
      },
      {
        "polish": "‘Co to za skręt? Kiedy wreszcie rzucisz narkotyki?’ ‘To nie moje! Rzuciłem kiedy ciebie poznałem, skarbie. Tylko ciebie kocham!’ ‘To ja, twój ojciec.’",
        "english": "‘What is this joint? When will you finally quit those drugs?’ ‘That’s not mine! I quit when I met you, sweetheart. You’re the only one I love!’ ‘It’s me your father.’"
      },
      {
        "polish": "Matka mówi do swojej córki - ‘dlaczego wracasz do domu tak późno? Kiedy ja byłam w twoim wieku...’ ‘tak, tak, wiem.Nie wychodziłaś z domu, bo miałam 5 miesięcy.’",
        "english": "A mother says to her daughter, ‘Why are you coming home so late? When I was your age...’ ‘Yes, yes, I know. You didn’t leave the house because I was 5 months old.’"
      },
      {
        "polish": "‘Panie Kowalski, mam dobrą i złą wiadomość. Zła wiadomość jest taka, że amputowaliśmy panu obie nogi.’ ‘A dobra wiadomość?’ ‘Znaleźliśmy kogoś, kto chciałby kupić pana buty.’",
        "english": "‘Mr Kowalski, I have good news and bad news. The bad news is that we have amputated both of your legs.’ ‘And the good news?’ ‘We have found someone who’d like to buy your shoes.’"
      },
      {
        "polish": "Rano matka pyta swojego syna - ‘Co to był za hałas w środku nocy?’ ‘Nic, spadła moja kurtka’ ‘Co w niej było?’ ‘Ja.’",
        "english": "A mother asks her son in the morning, ‘What was that noise in the middle of the night?’ ‘Nothing, my jacket fell down’ ‘What was in it?’ ‘Me.’"
      },
      {
        "polish": "Emma, kiedy zdałaś sobie sprawę z tego, że podobają ci się dziewczyny, a nie chłopcy?",
        "english": "Emma, when did you realise that you like girls, not boys?"
      },
      {
        "polish": "‘Dobry wieczór, panie prezydencie. Cudownie móc wreszcie przeprowadzić z panem wywiad.’ ‘Jak pan się tu dostał? Ochrona!’",
        "english": "‘Good evening, Mr President. It is wonderful to finally interview you.’ ‘How did you get in here? Security!’"
      },
      {
        "polish": "Moja rodzina ma ten naszyjnik od 120 lat.",
        "english": "My family have had this necklace for 120 years."
      },
      {
        "polish": "‘Mam cudownego męża. Nie pije, nie pali ani mnie nie bije.’ ‘Długo jest sparaliżowany?’",
        "english": "‘I have a wonderful husband. He doesn’t drink, smoke or beat me.’ ‘Has he been paralyzed for a long time?’"
      },
      {
        "polish": "w biurach publicznej biblioteki policja odkryła krzewy marihuany. Lolalni mieszkańcy są w szoku. Nie mieli pojęcia o tym, że mieli w swoim mieście bibliotekę.",
        "english": "In the officers of public library the police has discovered marijuana plants. The local residents are in shock. They had no idea there was a library in their town."
      },
      {
        "polish": "Nie rozmawiałem ze swoją żoną od 18 miesięcy. Nie chcę jej po prostu przeszkadzać.",
        "english": "I haven’t spoken to my wife for 18 months. I just don’t want to interrupt her."
      },
      {
        "polish": "Wraz z Alice mieszaliśmy przez kilka miesięcy, po czym przeprowadziła się do Hiszpanii, gdzie pracuje jako nauczyciel.",
        "english": "Alice and I lived together for a few months and then she leaved for Spain, where she works as a teacher."
      },
      {
        "polish": "W dniu Walentynek nastolatek wchodzi do apteki ‘Dzień dobry.’ ‘Skończyły się.’ ‘Do widzenia.’",
        "english": "On Valentine’s Day a teenager walks into a chemist’s. ‘Good evening.’ ‘We have ran out.’ ‘Good night.’"
      },
      {
        "polish": "Uwielbiam to, gdy idę ulicą i widzę ludzi uśmiechających się do siebie samych. Może otrzymali miłą wiadomość, może zdali egzamin, a może kogoś zabili.",
        "english": "I love it when I walk down the street and see someone smiling to themselves. Maybe they have received a sweet text, maybe they have passed a test and maybe they have killed someone."
      },
      {
        "polish": "Dzieci nie zjadły niczego od śniadania. Próbujesz je głodzić?",
        "english": "The children haven’t eaten anything since breakfast. Are you trying to starve them?"
      },
      {
        "polish": "Byłam dzisiaj w filharmonii, galerii sztuki, w teatrze i w muzeum. Wszystkie damskie toalety były bardzo eleganckie.",
        "english": "I have been to philharmonic, an art gallery, a theatre and a museum today. All the ladies’ rooms were very elegant."
      },
      {
        "polish": "Naprawdę zjadłaś wczoraj w nocy całe ciasto? Nie zostawiłaś mi nawet jednego kawałka?",
        "english": "Did you really eat the whole cake last night? You didn’t even leave one piece for me?"
      },
      {
        "polish": "‘Dziadku, widziałeś gdzieś białą pigułkę?’ ‘Nie, a widziałeś smoka spacerującego po naszym ogrodzie?!’",
        "english": "‘Grandpa, have you seen a small white pill anywhere?’ ‘No. But have you seen the dragon walking in our garden?!’"
      },
      {
        "polish": "‘Johnny, odrabiłeś lekcje? ’ ‘Wczoraj mój brat wyszedł z więzienia i urządziliśmy imprezę.’ ‘Nie strasz mnie swoim bratem. Siadaj, 5+.’",
        "english": "‘Johnny, have you done your homework?’ ‘My brother left prison yesterday and we had a party.’ ‘Don’t threaten me with your brother. Sit down, B+.’"
      },
      {
        "polish": "‘Miesiąc temu kupiłem swojej żonie kolczyki z diamentem i od tamtego momentu nie odzywała się do mnie.’ ‘Dlaczego?’ ‘Taka była nasza umowa.’",
        "english": "‘A month ago I bought my wife diamond earrings and she hasn’t spoken to me since then.’ ‘Why?’ ‘That was our deal.’"
      },
      {
        "polish": "Z diennika administratora: ‘Wracam do domu i zastaję moją żonę w łóżku z naszym sąsiadem. W ich oczach jest złość. Patrzę na komputer i zgadza się - zmienili hasło.",
        "english": "From an admin’s diary: ‘I come home and my wife is in bed with our neighbour. And their eyes are so evil-looking. I look at the computer and it’s true - they have changed the password.’"
      },
      {
        "polish": "‘Peter, wziąłeś prysznic?’ ‘Dlaczego zawsze oskarżasz mnie kiedy tylko coś zniknie w tym domu?’",
        "english": "‘Peter, have you taken a shower?’ ‘Why do you always blame me whenever something disappears in this house?’"
      },
      {
        "polish": "‘W zeszłym tygodniu wygrałem 10 milionów dolarów!’ ‘Gratulacje! Co powiedziała twoja żona?’ ‘Oniemiała’ ‘Zazdroszczę ci. Tyle szczęście jednego dnia.’",
        "english": "‘I won ten million dollars last week!’ ‘Congratulations! What did your wife say?’ ‘She was speechless.’ ‘I envy you. So much luck in one day.’"
      },
      {
        "polish": "Rozmawia dwóch studentów. ‘Dlaczego jesteś smutny?’ ‘Wywalili mnie ze studiów’ ‘Dlaczego?’ ‘Skąd mam wiedzieć? Nie byłem tam od miesięcy!’",
        "english": "Two students are talking. ‘Why are you so sad?’ ‘They have thrown me out of college.’ ‘Why?’ ‘How do I know? I haven’t been there for months!’"
      },
      {
        "polish": "‘Jimmy, potrafisz liczyć?’ ‘Tak, tato mnie nauczył.’ ‘W takim razie co jest po 6?’ ‘7.’ ‘Świetnie! a po 8?’ ‘9.’ ‘Wspaniale! a po 10?’ ‘Walet.’",
        "english": "‘Jimmy, can you count?’ ‘Yes, my daddy has taught me.’ ‘Then what comes after 6? ‘7.’ ‘Great! And after 8?’ ‘9.’ ‘Wonderful! And after 10?’ ‘A jack.’"
      },
      {
        "polish": "Zakochałem się.",
        "english": "I’ve fallen in love."
      },
      {
        "polish": "Widziałam ducha.",
        "english": "I have seen a ghost."
      },
      {
        "polish": "Widziałeś tego ducha?",
        "english": "Did you see that ghost?"
      },
      {
        "polish": "Bądź cicho. Spektakl się zaczął.",
        "english": "Be quiet. The play has begun."
      },
      {
        "polish": "Gdzie znalazłeś moje spinacze?",
        "english": "Where did you find my paperclips?"
      },
      {
        "polish": "Czytałeś te recenzję?",
        "english": "Have you read this review?"
      },
      {
        "polish": "Choinka to stoi od świąt.",
        "english": "The Christmas tree has stood here since Christmas."
      },
      {
        "polish": "Obcięłaś włosy! Pięknie wyglądasz.",
        "english": "You have cut your hair! You look beautiful."
      },
      {
        "polish": "Nie widziałam jeszcze tego filmiku.",
        "english": "I haven’t seen this video yet."
      },
      {
        "polish": "Co się stało?",
        "english": "What happened?"
      },
      {
        "polish": "Jadłam wczoraj sushi i nie zrobiłam zdjęcia. Tak, jestem zdrowa.",
        "english": "I ate sushi yesterday and I didn’t take a photo. Yes, I’m healthy."
      }
    ]
  },
  {
    "topic": "I have been singing - Present Perfect Continuous",
    "id": 23,
    "sentences": [
      {
        "polish": "Mówiłem przez sen.",
        "english": "I’ve been talking in my sleep."
      },
      {
        "polish": "Dziecko śpi od 7 godzin.",
        "english": "The baby has been sleeping for 7 hours."
      },
      {
        "polish": "Pada przez cały dzień.",
        "english": "It’s been raining all day."
      },
      {
        "polish": "Nosiliśmy pudła przez cały dzień.",
        "english": "We have been carrying boxes all day."
      },
      {
        "polish": "Mój rodzice kłócą się od godziny.",
        "english": "My parents have been arguing for an hour."
      },
      {
        "polish": "Myślałem o tobie.",
        "english": "I’ve been thinking about you."
      },
      {
        "polish": "Nauczyciel dawał tobie sprawdziany przez cały rok.",
        "english": "The teacher has been giving you tests all year."
      },
      {
        "polish": "Od dwóch godzin sąsiedzi wiercą wiertarką.",
        "english": "The neighbors have been drilling for two hours."
      },
      {
        "polish": "Ćwiczę boks od dzieciństwa.",
        "english": "I have been practicing boxing since childhood."
      },
      {
        "polish": "Szukaliśmy nowego domu.",
        "english": "We have been looking for a new house."
      },
      {
        "polish": "Wykonywałam to ćwiczenia od zawsze.",
        "english": "I have been doing this exercise for ages."
      },
      {
        "polish": "Leżałaś w łóżku cały dzień? Wstawaj! Dochodzi 16:00!",
        "english": "Have you been lying in bed all day? Get up! It’s almost 4 p.m.!"
      },
      {
        "polish": "Billy umawia się Polly od 3 lat. Są razem bardzo szczęśliwi i chcą wziąć ślub.",
        "english": "Billy has been going out with Polly for three years. They are very happy together and they want to get married."
      },
      {
        "polish": "Żona sprząta i śpiewa. Jej mąż mówi do niej - 'Mogłaś mi powiedzieć, że będziesz śpiewać. Od pół godziny olejuję zawiasy w bramie!'",
        "english": "A wife is cleaning and singing. Her husband says to her, ‘You could have told me you’ll be singing. I have been oiling the gate hinges for half an hour!’"
      },
      {
        "polish": "Wiem, że od lat studiowałeś angielski. Jednak, jeżeli będziesz próbował kupić lunch w chińskiej restauracji, to prawdopodobnie i tak będziesz mieć problemy.",
        "english": "I know you have been studying English for years. But if you try to buy lunch in a Chinese restaurant, you’ll probably have problems anyway."
      },
      {
        "polish": "Chloe bardzo pomogła mi w ogrodzie.",
        "english": "Chloe has been helping me in the garden a lot."
      },
      {
        "polish": "Od czasu wystartowania tej firmy staramy się pracować jako drużyna.",
        "english": "Ever since the launch of this company we have been trying to work as a team."
      },
      {
        "polish": "Nie uczyłam się zbyt wiele, więc wyniki egzaminu mogą być słabe. Być może będę musiała go powtórzyć.",
        "english": "I haven’t been studying much, so the exam result may be bad. Perhaps I’ll have to retake the exam."
      },
      {
        "polish": "Dlaczego Twoja praca domowa nie jest gotowa? Co robiłeś przez cały tydzień?",
        "english": "Why is your homework not ready? What have you been doing all week?"
      },
      {
        "polish": "Pamiętam kiedy będąc dzieckiem dowiedziałem się skąd biorą się dzieci. Wtedy za każdym razem kiedy widziałem kobietę w ciąży myślałem 'wiem co robiłaś!'",
        "english": "I remember when I was a child and I learned where babies come from. Then every time I saw a pregnant woman I thought, ‘I know what have you been doing!’"
      },
      {
        "polish": "Mój mąż nie pomagał mi zbyt wiele przy domu. Muszę z nim o tym porozmawiać.",
        "english": "My husband hasn’t been helping me around the house much. I must talk to him about it."
      },
      {
        "polish": "Planujemy ślub od roku.",
        "english": "We have been planning the wedding for a year."
      },
      {
        "polish": "Sprzątam od rana.",
        "english": "I have been cleaning since morning."
      },
      {
        "polish": "Adriene ćwiczy jogę od 2002 roku.",
        "english": "Adriene has been practising yoga since 2002."
      },
      {
        "polish": "Nie pracuję w piekarni od 7 lat.",
        "english": "I haven’t been working at the bakery for 7 years."
      },
      {
        "polish": "Jak długo grasz na wiolonczeli?",
        "english": "How long have you been playing this cello."
      },
      {
        "polish": "Czekam na ciebie od 2 godzin!",
        "english": "I have been waiting for you for two hours!"
      }
    ]
  },
  {
    "topic": "I have sung czy I have been singing? - Present Perfect czy Present Perfect Continuous?",
    "id": 24,
    "sentences": [
      {
        "polish": "Ile stron tej książki przeczytałeś?",
        "english": "How many pages of this book have you read?"
      },
      {
        "polish": "Jak długo czytałeś tę książkę?",
        "english": "How long have you been reading this book?"
      },
      {
        "polish": "Ile książek przeczytałeś w tym roku?",
        "english": "How many books have you read this year?"
      },
      {
        "polish": "Christina pisała swoje wypracowanie od trzech godzin. Napisała jedynie 2 strony.",
        "english": "Christina has been writing her essay for three hours. She has written only two pages."
      },
      {
        "polish": "Moi rodzice cały dzień gotowali. Zrobili spaghetti, dwie pizze i faszerowanego kurczaka.",
        "english": "My parents have been cooking all day. They have cooked this spaghetti, two pizzas and a stuffed chicken."
      },
      {
        "polish": "Łowiliśmy ryby cały dzień, ale nic nie udało nam się złapać.",
        "english": "We have been fishing all day, but we haven’t caught anything."
      },
      {
        "polish": "‘Dlaczego tak ciężko oddychasz?’ ‘Biegłem przez 15 minut. W końcu zatrzymałem się i powiedziałem kobiecie, że nie chcę już jej portmonetki.’",
        "english": "‘Why are you breathing so heavily?’ ‘I have been running for 15 minutes. Finally I stopped and told the lady I don’t want her pures anymore.’"
      },
      {
        "polish": "Greg gra w gry od sześciu godzin. Zagrał w 4 gry, których nienawidzi.",
        "english": "Greg has been playing games for six hours. He has played 4 games and he hates them all."
      },
      {
        "polish": "Diana rozmawiała z tamtym facetem od pół godziny i nadal nie powiedział nic interesującego.",
        "english": "Diana has been talking to that guy for half an hour and he still hasn’t said anything interesting."
      },
      {
        "polish": "‘Spakowałam ci chleb, masło i kilogram paznokci.’ ‘Dlaczego?’ ‘Posmarujesz masłem chleb i zjesz.’ ‘A paznokcie?’ ‘Są tam. Spakowałam je.’",
        "english": "‘I have packed some bread, butter and a kilogram of nails for you.’ ‘Why?’ ‘You will put the butter on the bread and eat it.’ ‘And the nails?’ ‘They are here. I’ve packed them.’"
      },
      {
        "polish": "Mój tato czyścił okna przez cały dzień, ale wyczyścił jak dotąd tylko trzy. Sądzę, że robi zbyt dużo przerw na papierosa.",
        "english": "My dad has been cleaning windows all day but he has cleaned only three so far. I think he takes too much cigarette breaks."
      },
      {
        "polish": "Ile razy byłeś w Paryżu?",
        "english": "How many times have you been to Paris?"
      },
      {
        "polish": "‘Dlaczego twoje oczy są takie czerwone?’ ‘Paliliśmy trawkę, Tato.’ ‘Nie okłamuj mnie! Pewnie dostałeś kolejną jedynkę z WF-u i płakałeś!’",
        "english": "‘Why are your eyes so red?’ ‘We have been smoking pot, Dad.’ ‘Don’t lie to me! You probably got another F in PE and you had been crying!’"
      },
      {
        "polish": "Ile czekolad dzisiaj zjadła?",
        "english": "How many chocolates has she eaten today?"
      },
      {
        "polish": "Jak długo jadła dzisiaj czekolady?",
        "english": "How long has she been eating chocolates today?"
      },
      {
        "polish": "Przez cztery dni dawałam mojemu kotu krople do oczu. Podrapie mnie jeszcze 54 razy i będzie po wszystkim.",
        "english": "For four days I have been giving my cat eye drops. She will give me only 54 more scratches and we will be done."
      },
      {
        "polish": "Ostatnio oglądałem dużo YouTube, ale nie oglądałem jeszcze tego kanału.",
        "english": "I’ve been watching a lot of YouTube recently, but I haven’t watched this channel yet."
      },
      {
        "polish": "Pijany mąż wraca późno do domu. Jego rozzłoszczona żona wita go w drzwiach. ‘Szukałem cie całą noc we wszystkich barach a ty byłaś w domu przez ten cały czas?!’",
        "english": "A drunk husband returns home very late. His angry wife greets him at the door. ‘I have been looking for you all night and all the bars and you have been at home all this time?!’"
      },
      {
        "polish": "Idź spać. Ziewasz już od godziny.",
        "english": "Go to sleep. You have been yawning for an hour."
      },
      {
        "polish": "Ile razy ziewnąłeś tego wieczoru?",
        "english": "How many times have you yawned this evening?"
      },
      {
        "polish": "Siedzimy tutaj całą noc. Myślisz, że zapomniał o spotkaniu?",
        "english": "We have been sitting here all night. Do you think maybe he has forgotten about the meeting?"
      },
      {
        "polish": "Od 20 lat robi kartki świąteczne. W tym roku sprzedał ich 300.",
        "english": "He has been making Christmas cards for 20 years. This year he has sold 300 of them."
      },
      {
        "polish": "Pijany mąż wraca do domu z makijażem na twarzy. ‘Co to ma znaczyć?!’ ‘Kochanie, nie uwierzysz w to, ale biłem się z klaunem.’",
        "english": "A drunk husband returns home with his face covered with makeup. ‘What is this supposed to mean?!’ ‘Honey, you’re not gonna believe this but I have fought with a clown.’"
      },
      {
        "polish": "Drogi Marty, jeżeli moje kalkulacje są prawidłowe, otrzymasz ten list zaraz po tym, jak zobaczyłeś DeLorean trafiony piorunem. Zapewniam cię, że żyję i jestem cały. Przez ostatnie osiem miesięcy żyłem szczęśliwie w roku 1885.",
        "english": "Dear Marty, if my calculations are correct, you will receive this letter immediately after you saw the DeLorean struck by lightning. First, let me assure you that I am alive and well. I have been living happily these past eight months in the year 1885."
      },
      {
        "polish": "Pracowaliśmy 20 godzin dziennie bez przerwy przez trzy i pół tygodnia. Po prostu weź wolną noc. Idź do swojej żony, swojej córki.",
        "english": "We have been working 20 hours a day for three and half weeks straight. Just take the night off. Go see your wife, your daughter."
      },
      {
        "polish": "Harry Potter złapał Snitch. Wygrywa Gryffindor!",
        "english": "Harry potter has caught the Snitch. Gryffindor wins!"
      },
      {
        "polish": "Ogr zakochał się w księżniczce.",
        "english": "The ogre has fallen in love with the princes."
      },
      {
        "polish": "Śpią od 20:00.",
        "english": "They have been sleeping since 8 p.m."
      },
      {
        "polish": "Mówił ci o tym.",
        "english": "He’s been telling you about this."
      },
      {
        "polish": "Powiedział ci o tym.",
        "english": "He has told you about this."
      },
      {
        "polish": "Co robiłeś?",
        "english": "What have you been doing?"
      },
      {
        "polish": "Co zrobiłeś?",
        "english": "What have you done?"
      },
      {
        "polish": "Uczę się hiszpańskiego od 3 lat.",
        "english": "I’ve been studying Spanish for 3 years."
      },
      {
        "polish": "Nauczyła się hiszpańskiego w 8 lat.",
        "english": "She has learnt Spanish in 8 years."
      },
      {
        "polish": "Piszę od rana.",
        "english": "I’ve been writing since morning."
      },
      {
        "polish": "Napisałam 20 stron.",
        "english": "I’ve written 20 pages."
      },
      {
        "polish": "Jak długo masz prawo jazdy?",
        "english": "How long have you had your driving licence?"
      },
      {
        "polish": "Jak długo on o tym wie?",
        "english": "How long has he known about this?"
      }
    ]
  },
  {
    "topic": "I had stolen - Past Perfect",
    "id": 25,
    "sentences": [
      {
        "polish": "Odwiedziliśmy Wenecję w 2002. Nie widziałam nic tak pięknego.",
        "english": "We visited Venice in 2002. We hadn’t seen anything so beautiful."
      },
      {
        "polish": "Kiedy dotarliśmy do kina, film już się zaczął.",
        "english": "When we got to the cinema, the film had already started."
      },
      {
        "polish": "Czerwony Kapturek spotkał wilka i dotarł do domu babci.",
        "english": "The Little Red Riding Hood met a wolf and she got to her grandmother’s house."
      },
      {
        "polish": "Czerwony Kapturek dotarł do domu babci po tym, jak spotkał wilka.",
        "english": "The Little Red Riding Hood got to her grandmothers house after she had met a wolf."
      },
      {
        "polish": "Gdy dotarła do domku, przyszedł wilk.",
        "english": "When she got to the house, the wolf came."
      },
      {
        "polish": "Gdy dotarła do domku, wilk już tam był.",
        "english": "When she got to the house, the wolf had come."
      },
      {
        "polish": "Już go wcześniej poznałem.",
        "english": "I had met him before."
      },
      {
        "polish": "Dotknąłeś moja kubka!",
        "english": "You had touched my mug!"
      },
      {
        "polish": "Przestał padać.",
        "english": "The rain had stopped."
      },
      {
        "polish": "Nie słyszałam o tym.",
        "english": "I hadn’t heard about it."
      },
      {
        "polish": "Nie spuścił wody.",
        "english": "He hadn’t flushed."
      },
      {
        "polish": "Nie kupili tamtych biletów.",
        "english": "They hadn’t bought those tickets."
      },
      {
        "polish": "Co ja powiedziałam?",
        "english": "What had I said?"
      },
      {
        "polish": "Poprosiłaś o pomoc?",
        "english": "Had you asked for help?"
      },
      {
        "polish": "Oświadczył się jej?",
        "english": "Had he proposed to her?"
      },
      {
        "polish": "Rozmawialiście?",
        "english": "Had you spoken?"
      },
      {
        "polish": "Czy Jenny podlała kwiaty?",
        "english": "Had Jenny watered the plants?"
      },
      {
        "polish": "Udostępniałam filmik z kotem.",
        "english": "I had shared a cat video."
      },
      {
        "polish": "Nauczyłeś pływać.",
        "english": "You’d taught me how to swim."
      },
      {
        "polish": "Moja mama zapomniała o moich urodzinach.",
        "english": "My mom had forgotten my birthday."
      },
      {
        "polish": "Świetnie spędziliśmy czas.",
        "english": "We’d had a great time."
      },
      {
        "polish": "Ugryzł mnie pająk.",
        "english": "A spider had bitten me."
      },
      {
        "polish": "Mój samochód odpalił.",
        "english": "My car had started."
      },
      {
        "polish": "Donald wygrał wybory.",
        "english": "Donald had won the election."
      },
      {
        "polish": "Dali nam pieniądze.",
        "english": "They had given us money."
      },
      {
        "polish": "Vicky znalazła swój dowód osobisty.",
        "english": "Vicky had found her ID."
      },
      {
        "polish": "Wszyscy byli dla mnie mili.",
        "english": "Everyone had been kind to me."
      },
      {
        "polish": "Spiderman wyszedł.",
        "english": "Spiderman had left."
      },
      {
        "polish": "Musiałam wrócić do domu z lotniska, bo zapomniałam o swoim paszporcie.",
        "english": "I had to come back home from the airport because I had forgotten my passport."
      },
      {
        "polish": "Mój tata ma trzech braci i trzy siostry, ale nigdy nie mieszkali razem. Kiedy najmłodsze rodzeństwo sie urodziło, najstarsze zdażyło wyprowadzić się.",
        "english": "My dad has three brothers and three sisters, but they never lived together. When’s our youngest sibling was born, the oldest had that already moved out."
      },
      {
        "polish": "Bridget spytała swojego wujka czy poprowadzi ją do ołtarza na ślubie, bo jej ojciec umarł rok wczesniej.",
        "english": "Bridget asked her uncle to give her away at the wedding because her father had died a year before."
      },
      {
        "polish": "‚Kupiłeś szczotkę do toalety jak cię wczoraj prosiłam?’ ‚Tak, ale wciąż wole używać papieru toaletowego’",
        "english": "‘Did you buy the toilet brush yesterday like I had said?’ ‘Yes, but I still prefer toilet paper.’"
      },
      {
        "polish": "Mój komputer zepsuł się po tym jak miałem go 5 lat.",
        "english": "My computer broke down after I had had it for 5 years."
      },
      {
        "polish": "Mój komputer zepsuł się w momencie gdy wziąłem go by go naprawić",
        "english": "My computer had broken down when I took it to be repaired."
      },
      {
        "polish": "Harriet umyła piekarnik, ponieważ w środku eksplodował sernik.",
        "english": "Harriet cleaned her oven because a cheesecake had exploded inside."
      },
      {
        "polish": "Chciałam zaprosić Ella na mój ślub, ale wtedy uświadomiłam sobie, że przeprowadziła się do Australii.",
        "english": "I wanted to invate Ella to my wedding but when I realised she had moved to Australia."
      },
      {
        "polish": "Kiedy cię poznałam dopiero co upublikowałeś swoją pierwszą książkę. A teraz popatrz na siebie, jesteś zwycięzcą nagrody Nobla!",
        "english": "When I met you, you had just published your first book. And now look at you, you’re a Nobel Prize winner!"
      },
      {
        "polish": "Dlaczego wzięłaś ten pierścionek ze sklepu? Nie zapłaciliśmy za niego!",
        "english": "Why did you take this ring from the shop? We hadn’t paid for it!"
      },
      {
        "polish": "Paul nie wiedział jak jego żona zaszła w ciążę, bo nie widzieli siebie od roku.",
        "english": "Paul didn’t know how his wife had became pregnant because they hadn’t seen each other for a year."
      },
      {
        "polish": "Odwiedziłem Paltryville wiele lat później. Było to długo po tym jak Lucky Smells Lumbermill zamknął swoje drzwi a biuro Dr Orwell'a upadło w ruinę.",
        "english": "I visited Paltryville myself many years later. It was long after the Lucky Smells Lumbermill had closed its doors and Dr Orwell’s office had fallen into disrepair."
      },
      {
        "polish": "Mr. Anderson wybrał czerwoną pigułkę. Właśnie dlatego obudził się w prawdziwym świecie, a nie w matriksie.",
        "english": "Mr. Anderson had chosen the red pill. That is why he woke up in the real world, not in the Matrix."
      },
      {
        "polish": "Polly smażyła placki tak jak nauczyła ją jej matka.",
        "english": "Polly fried the pancakes just like her mother had taught her."
      },
      {
        "polish": "Krzysztof Kolumb nie był pierwszym europejskim odkrywcą, który dotarł do Ameryk. Wybrawa wikingów prowadzona przez Leif Erikson dotarła tam w XI wieku.",
        "english": "Christopher Columbus wasn’t the first European explorer to reach the Americas. The Vikings expedition led by Leif Erikson had reached it in 11th century."
      },
      {
        "polish": "Wreszcie prezydent odpowiedział na mój list, który do niego napisałem.",
        "english": "The president finally replied to the letter that I had written to him."
      },
      {
        "polish": "Jak mogłam wyleczyć moje dzieci z choroby, którą złapał cały oddział szpitalny?",
        "english": "How could I cure my kids of a disease the whole ward had caught?"
      },
      {
        "polish": "Rycerz wyczyścił miecz, ponieważ tamtego ranka odciął nim trzy głowy.",
        "english": "The knight cleaned the sword because he had cut off three heads with it that morning."
      },
      {
        "polish": "Zeszłej nocy widziałam wywiad z Robertem De Niro, co było dla mnie dziwne, ponieważ nie pokazywał się na wywiadach od lat.",
        "english": "I saw an interview with Robert De Niro last night, which is strange because he hadn’t appeared in interviews for years."
      },
      {
        "polish": "Mój syn był tak zaskoczony odebraniem pucharu, ponieważ nigdy wcześniej niczego nie wygrał.",
        "english": "My son was so surprised to get the trophy because he had never won anything before."
      }
    ]
  },
  {
    "topic": "I had been stealing - Past Perfect Continuous",
    "id": 26,
    "sentences": [
      {
        "polish": "Wulkanu wybuchł w 2002 roku. Od 130 lat był uśpiony.",
        "english": "The volcano erupted it in 2002. It had been sleeping for 130 years."
      },
      {
        "polish": "Czekałam od 15:00.",
        "english": "I had been waiting since 3 p.m."
      },
      {
        "polish": "Mama śpiewała od 10 minut.",
        "english": "Mum had been singing for 10 minutes."
      },
      {
        "polish": "Pomagaliśmy im od lat.",
        "english": "We’d been helping them for years."
      },
      {
        "polish": "Nie uczyłam się za długo.",
        "english": "I hadn’t been studying very long."
      },
      {
        "polish": "Jerry tu nie pracował.",
        "english": "Jerry hadn’t been working here."
      },
      {
        "polish": "Nic nie robili.",
        "english": "They hadn’t been doing anything."
      },
      {
        "polish": "Co ja myślałem?",
        "english": "What had I been thinking?"
      },
      {
        "polish": "Uważałeś?",
        "english": "Had you been paying attention?"
      },
      {
        "polish": "Jak długo mieszkała sama?",
        "english": "How long had she been living alone?"
      },
      {
        "polish": "Długo pracowałeś?",
        "english": "Had you been working long?"
      },
      {
        "polish": "Czy pilot tym latał?",
        "english": "Had the pilot been flying this?"
      },
      {
        "polish": "Śniłam.",
        "english": "I had been dreaming."
      },
      {
        "polish": "Leżałaś w moim łóżku.",
        "english": "You had been lying on my bed."
      },
      {
        "polish": "Nancy robiła ciasto szarlotkę.",
        "english": "Nancy had been making an apple pie."
      },
      {
        "polish": "Rozmawialiśmy o blogu modowym.",
        "english": "We’d been talking about a fashion blog."
      },
      {
        "polish": "Czy dzieci aktualizowały swoje telefony?",
        "english": "Had the kids been updating their phones?"
      },
      {
        "polish": "Czy pan młody golił się?",
        "english": "Had the groom been shaving?"
      },
      {
        "polish": "Jej brat prowadził całą noc.",
        "english": "Her brother had been driving all night."
      },
      {
        "polish": "Nie myślałam o serniku.",
        "english": "I hadn’t been thinking about a cheesecake."
      },
      {
        "polish": "Ignorowałeś mnie?",
        "english": "Had do you been ignoring me?"
      },
      {
        "polish": "Mój terapeuta nie pomagał mi.",
        "english": "My therapist hadn’t been helping me."
      },
      {
        "polish": "Ludzie klaskali.",
        "english": "People had been applauding."
      },
      {
        "polish": "Nie byłam zaskoczona tym co Michael robił od dłuższego czasu.",
        "english": "I wasn’t surprised to see what Michael had been doing for such a long time."
      },
      {
        "polish": "‚Mój pies siada przy komputerze każdego wieczoru i przegląda internet.’ ‚Co za inteligentny zwierzę!’ ‚Nie do końca. Kot uczył go tego przez 3 tygodnie.’",
        "english": "‘My dog sits at the computer every evening and browses the Internet.’ ‘What an intelligent animal!’ ‘Not really. The cat had been teaching him that for 3 weeks.’"
      },
      {
        "polish": "Dlaczego okłamywałeś nas tak długo?",
        "english": "Why had you been lying to us for so long?"
      },
      {
        "polish": "Szczeniaczek wyglądał na chudego i zmęczonego. Nie jadł dniami.",
        "english": "The puppy looked thin and tired. She hadn’t been eating for days."
      },
      {
        "polish": "Mój stary samochód odpalił natychmiastowo, mimo że stał na zimnie dniami.",
        "english": "My old car started immediately even though it had been standing in the freezing cold for days."
      },
      {
        "polish": "Padało cały dzień kiedy wreszcie wyszło słońce i ślub wyglądał pięknie.",
        "english": "It had been raining all day when the sun finally came out and then wedding was beautiful."
      },
      {
        "polish": "‘Znalazłem Simona pokrytego krwią.’ ‘Co on robił?’",
        "english": "‘I found Simon covered in blood.’ ‘What had he been doing?’"
      },
      {
        "polish": "Kot drapał kanapę przed trzy lata kiedy w końcu oduczyłem go tego. Zajęło mi to tylko cztery dni. #brawoja",
        "english": "The cat had been scratching the sofa for three years when I finally taught her not to. It only took me four days. #yayme"
      },
      {
        "polish": "Na szczęście, Greg wiedział co ma zrobić, ponieważ pracował jako strażak od 1998.",
        "english": "Thankfully, Greg knew what to do because he had been working as a firefighter since 1998."
      },
      {
        "polish": "Mężczyzna w skórzanej kurtce uśmiechnął się do mnie i wtedy uświadomiłam sobie, że gapiłam się na niego od 20 minut.",
        "english": "The man in the leather jacket smiled at me when I realised I had been staring at him for 20 minutes."
      },
      {
        "polish": "Przez pół godziny szukałam mojego kota, kiedy znalazłam go w łazience.",
        "english": "I had been looking for my cat for half an hour when I found her in the bathroom."
      },
      {
        "polish": "Dałam ci wszystko, co od ciebie dostawałam. ",
        "english": "I gave you everything that I had been receiving from you."
      },
      {
        "polish": "Od kiedy tam pracowałeś?",
        "english": "Since when had you been working there?"
      },
      {
        "polish": "Nie uczyła się do egzaminu i dlatego go oblała.",
        "english": "She hadn’t been studying for the exam and that’s why she failed it."
      },
      {
        "polish": "Kiedy przyszedłem, wszyscy tańczyli od wielu godzin.",
        "english": "When I came, everyone had been dancing for many hours."
      },
      {
        "polish": "Pisał do niej listy od lat.",
        "english": "He had been writing letters to her for years."
      },
      {
        "polish": "Jak długo sprzedawałeś zioła?",
        "english": "How long had you been selling herbs?"
      },
      {
        "polish": "Nagrywał piosenki od 17 roku życia.",
        "english": "He had been recording songs since the age of 17."
      },
      {
        "polish": "John szukał pracy od tygodni.",
        "english": "John had been looking for a job for weeks."
      },
      {
        "polish": "Od dawno nie padał śnieg.",
        "english": "It hadn’t been snowing for a long time."
      },
      {
        "polish": "Kogo zastępowała?",
        "english": "Who had she been replacing?"
      },
      {
        "polish": "Popełniłam ten błąd całe życie.",
        "english": "I had been making this mistake all my life."
      }
    ]
  },
  {
    "topic": "to play czy playing?",
    "id": 64,
    "sentences": [
      {
        "polish": "chciałby przepłynąć tę rzekę.",
        "english": "He’d like to swim across this river."
      },
      {
        "polish": "chcę się uwolnić.",
        "english": "I want to break free."
      },
      {
        "polish": "Pływanie to świetny sport.",
        "english": "Swimming is a great sport."
      },
      {
        "polish": "Boisz się latania?",
        "english": "Are scared of flying?"
      },
      {
        "polish": "Postanowiła więcej ćwiczyć.",
        "english": "She decided to work out more."
      },
      {
        "polish": "Oczekują, że niedługo otrzymają wyniki.",
        "english": "They expect to receive the results soon."
      },
      {
        "polish": "Uwielbiamy nabijać się z taty.",
        "english": "We love making fun of our dad."
      },
      {
        "polish": "Po prostu płyń dalej.",
        "english": "Just keep swimming."
      },
      {
        "polish": "Odmawiam całowania cioci Edny.",
        "english": "I refuse to kiss Aunt Edna."
      },
      {
        "polish": "Szef zagroził, że mnie zwolni.",
        "english": "My boss threatened to fire me."
      },
      {
        "polish": "Tom udawał, że mnie nie widzi.",
        "english": "Tom pretended not to see me."
      },
      {
        "polish": "Mam nadzieję, że nie zwymiotuję.",
        "english": "I hope not to throw up."
      },
      {
        "polish": "Polecamy skorzystać z sauny.",
        "english": "We recommend using the sauna."
      },
      {
        "polish": "Nie pozwalają tu palić.",
        "english": "They don’t allow smoking here."
      },
      {
        "polish": "Lubię nie musieć nic robić.",
        "english": "I like not having to do anything."
      },
      {
        "polish": "Pomówmy o tym, żeby jej nie zabijać.",
        "english": "Let’s discuss not killing her."
      },
      {
        "polish": "Nagle zaczął biec.",
        "english": "Suddenly he began running."
      },
      {
        "polish": "Nagle zaczął biec.",
        "english": "Suddenly he began to run."
      },
      {
        "polish": "Zaczynam rozumieć.",
        "english": "I’m starting to understand."
      },
      {
        "polish": "Zaczynali wychodzić.",
        "english": "They were beginning to leave."
      },
      {
        "polish": "Prowadenie auta jest łatwe.",
        "english": "Driving is easy."
      },
      {
        "polish": "Palenie jest tu zabronione.",
        "english": "Smoking is forbidden here."
      },
      {
        "polish": "Płacz jest dobry.",
        "english": "Crying is good."
      },
      {
        "polish": "Łatwo jest prowadzić auto.",
        "english": "It’s easy to drive."
      },
      {
        "polish": "Nie wolno tu palić.",
        "english": "It’s forbidden to smoke here."
      },
      {
        "polish": "Dobrze jest popłakać.",
        "english": "It’s good to cry."
      },
      {
        "polish": "Na to pytanie nie da się odpowiedzieć.",
        "english": "This question is impossible to answer."
      },
      {
        "polish": "Z dumą witamy nowych członków.",
        "english": "We’re pround to welcome new members."
      },
      {
        "polish": "Z przykrością się pożegnał.",
        "english": "He was sorry to say goodbye."
      },
      {
        "polish": "Nie warto oglądać tego filmu.",
        "english": "This film isn’t worth seeing."
      },
      {
        "polish": "Mama lubi tańczyć tango.",
        "english": "Mum is fond of dancing the tango."
      },
      {
        "polish": "Interesujesz się aktorstwem?",
        "english": "Are you interested in acting?"
      },
      {
        "polish": "Potrafię się porozumiewać po niemiecku.",
        "english": "I’m capable of communicating in German."
      },
      {
        "polish": "Mark był rozczarowany przegraną.",
        "english": "Mark was disappointed with losing."
      },
      {
        "polish": "Przyszłam tu, żeby pomóc.",
        "english": "I came here to help."
      },
      {
        "polish": "Ona jest za ciężka, żeby ją nieść.",
        "english": "She is too heavy to carry."
      },
      {
        "polish": "Mamy dość pieniędzy, żeby kupić trochę zioła.",
        "english": "We have enough money to buy some weed."
      },
      {
        "polish": "Lubi słuchać death metalu?",
        "english": "Does he like listening do death metal?"
      },
      {
        "polish": "Uwielbiamy oglądać filmiki z failami.",
        "english": "We love watching fail videos."
      },
      {
        "polish": "Bardzo mu się podoba śpiewanie na scenie.",
        "english": "He really enjoyed singing on stage."
      },
      {
        "polish": "Słodziła herbatę 3 łyżeczkami.",
        "english": "She liked to put 3 sugars in her tea."
      },
      {
        "polish": "Zwykle zasypiam, gdy oglądam telewizję.",
        "english": "I love to fall asleep when I watch TV."
      },
      {
        "polish": "Mój synek lubi leżeć na brzuszku.",
        "english": "My son likes lying on his belly."
      },
      {
        "polish": "Mój chłopak lubi leżeć na brzuchu.",
        "english": "My boyfriend likes to lie on his belly."
      },
      {
        "polish": "Paul nie cierpiał jeździć na nartach.",
        "english": "Paul hated skiing."
      },
      {
        "polish": "Tom nie cierpiał jeździć na nartach.",
        "english": "Tom hated to ski."
      },
      {
        "polish": "Nigdy nie lubiłem przyznawać się, że byłem w błedzie.",
        "english": "I never like to admit that I was wrong."
      },
      {
        "polish": "Tato przestał palić 16 lat temu.",
        "english": "Dad stopped smoking 16 years ago."
      },
      {
        "polish": "Tato zatrzymał się, żeby zapalić.",
        "english": "Dad stopped to smoke."
      },
      {
        "polish": "Nie cierpię mówić ci złych wieści.",
        "english": "I hate telling you bad news."
      },
      {
        "polish": "Niechętnie ci to mówię, ale zwalniam cię.",
        "english": "I hate to tell you, but you’re fired."
      },
      {
        "polish": "Kiwanie głową oznacza „tak”.",
        "english": "Nodding means saying yes."
      },
      {
        "polish": "Ona chce cię zranić.",
        "english": "She means to hurt you."
      },
      {
        "polish": "Próbowałem otworzyć słoik nożem, ale nie zadziałało.",
        "english": "I tried opening the jar with a knife, but it didn’t work."
      },
      {
        "polish": "Próbowałem otworzyć drzwi, ale były zamknięte na klucz.",
        "english": "I tried to open the door, but it was locked."
      },
      {
        "polish": "Może spróbuj jeść więcej czosnku, żeby być zdrowym.",
        "english": "Why don’t you try eating more garlic to stay healthy?"
      },
      {
        "polish": "Jeżeli nie ma jej w domu, spróbuj zadzwonić na komórkę.",
        "english": "If she isn’t at home, try calling her cell."
      },
      {
        "polish": "Pilot się zepsuł, więc spróbowałem zmienić baterie, ale to nie podziałało.",
        "english": "The remote broke dowm, so I tried changing the batteries, but it didn’t work"
      },
      {
        "polish": "Mama chce, żebym jej pomógł w kuchni.",
        "english": "Mum wants me to help her in the kitchen."
      },
      {
        "polish": "Lekarz chciał, żeby oddychał głęboko.",
        "english": "The doctor wanted him to breathe deeply."
      },
      {
        "polish": "Pani Cruz będzie chciała, żebyś jej naprawił zlew.",
        "english": "Mrs Cruz will want you to fix her sink."
      },
      {
        "polish": "Widziałam, jak przechodził przez ulicę.",
        "english": "I saw him crossing the street."
      },
      {
        "polish": "Widziałam, jak przeszedł przez ulicę.",
        "english": "I saw him cross the street."
      },
      {
        "polish": "Słyszała, jak śpiewałam hymn.",
        "english": "She heard me singing the anthem."
      },
      {
        "polish": "Słyszała, jak zaśpiewałam hymn.",
        "english": "She heard me sing the anthem."
      }
    ]
  }
]
